app/controllers/posts_controller.rb

SELECT * FROM "posts" ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
  def index
    @posts = Post.paginate :page => params[:page], :order => 'created_at DESC'

INSERT INTO "posts" ("updated_at", "topic", "post", "author", "created_at") VALUES('2009-05-04 11:27:19', NULL, 'Sverige1', NULL, '2009-05-04 11:27:19')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def update
    @post = Post.find(params[:id])